from flask import Flask, render_template, abort

app = Flask(__name__)

# คลังข้อมูลข่าวสารของคุณดนัย
ALL_NEWS = [
    {
        "id": 1,
        "title": "ดาบพิฆาตอสูร (鬼滅の刃) (Kimetsu no Yaiba)",
        "post_date": "4 มิถุนายน 2026",
        "category": "anime",
        "category_color": "#2ecc71",
        "detail": "เป็นซีรีส์หนังสือการ์ตูนของประเทศญี่ปุ่น เขียนเรื่องโดย โคโยฮารุ โกโตเกะ เนื้อหากล่าวถึงคามาโดะ ทันจิโร่ เด็กหนุ่มผู้กลายเป็นนักล่าอสูรหลังจากครอบครัวของตนถูกอสูรฆ่าตายทั้งหมด...",
        "full_detail": "เนื้อหาแบบละเอียด: นื้อเรื่อง
บทความหลัก: รายชื่อตัวละครในดาบพิฆาตอสูร
เรื่องราวเกิดขึ้นในประเทศญี่ปุ่นยุคไทโช คามาโดะ ทันจิโร่ เป็นเด็กหนุ่มผู้มีจิตใจอ่อนโยนและเฉลียวฉลาด ในฐานะลูกชายคนโตของครอบครัวคนเผาถ่าน เขาจึงเป็นหัวเรี่ยวหัวแรงในการหารายได้เลี้ยงดูครอบครัวจากการเผาถ่านไปขายหลังจากพ่อของเขาเสียชีวิต ทุกสิ่งทุกอย่างได้เปลี่ยนแปลงไปเมื่อมีอสูรบุกเข้ามาสังหารคนในครอบครัวของทันจิโร่ จนหมดสิ้นเหลือแต่เพียงเขาและน้องสาวที่ชื่อเนซึโกะเท่านั้น เนซึโกะที่รอดตายมาได้กลับกลายเป็นได้รับเลือดของอสูรจนกลายเป็นอสูรไป ทว่าก็น่าประหลาดใจที่เธอยังคงมีความรู้สึกนึกคิดและการแสดงอารมณ์อย่างมนุษย์ยิ่งคงหลงเหลืออยู่ หลังจากที่ทันจิโร่ได้ต่อสู้กับโทมิโอกะ กิยู นักล่าอสูรที่เดินทางผ่านมาและต้องการจะฆ่าเนซึโกะที่กลายเป็นอสูรไปแล้ว แต่เมื่อกิยูเห็นเนซึโกะปกป้องทันจิโร่ที่เป็นมนุษย์ กิยูได้จึงไว้ชีวิตเนซึโกะ และเขาจึงทำให้เนซึโกะหมดสติ และเขาจึงให้เนซึโกะคาบกระบอกไม้ไผ่ เอาไว้ในปากของเธอตลอดเวลา เพื่อป้องกันไม่ให้เธอทำร้ายมนุษย์ ทันจิโร่จึงตัดสินใจที่จะเป็นนักล่าอสูรตามคำชักชวนของกิยู เพื่อหาทางทำให้น้องสาวกลับมาเป็นมนุษย์ และกำจัดอสูรที่ฆ่าครอบครัวของเขาให้จงได้[3]

รูปแบบสื่อ
มังงะ
ผู้เขียนเรื่องและภาพเรื่องคือ โคโยฮารุ โกโตะเกะ หนังสือการ์ตูนเรื่องนี้เริ่มในปี พ.ศ. 2559 ตีพิมพ์ครั้งที่ 11 ของชูเอะชะ นิตยสารโชเน็งจัมพ์รายสัปดาห์ เมื่อวันที่ 15 กุมภาพันธ์ พ.ศ. 2559[4] บริษัทชูเอะชะเริ่มออกตัวซีรีส์หนังสือการ์ตูนพร้อมกันในภาษาอังกฤษ บนบริการของมังงะเซอร์วิส ในปี พ.ศ. 2562 หนังสือการ์ตูนมังงะนี้ได้รับการรวบรวมเป็นหนังสือเล่ม (ทังโคบง) กับเล่มแรกกำลังเผยแพร่เมื่อวันที่ 3 มิถุนายน พ.ศ. 2559[5] ณ เดือนกุมภาพันธ์ พ.ศ. 2562 หนังสือมังงะได้ปล่อยเป็น 19 เล่ม[6] ในเดือนเมษายน พ.ศ. 2563 ก็ประกาศว่ามีเล่มที่ 20 ที่ล่าช้าไปสองสัปดาห์เนื่องจากความกังวลของการระบาดไวรัสโควิด 19[7] ในปี พ.ศ. 2564 ก็ได้มีการออกเล่มสุดท้ายคือเล่มที่ 23 ถือว่าจบโดยบริบูรณ์

นวนิยายไลต์โนเวล
นวนิยายไลต์โนเวลได้มีการสิทธิคือ ดาบพิฆาตอสูร: ความสุขแห่งดอกไม้ (鬼滅の刃 しあわせの花 (Kimetsu no Yaiba Shiawase no Hana)) เขียนแต่งนิยายโดย โคโยฮารุ โกโตเกะ และ ยาจิมะ อายะ ตีพิมพ์นิยายในประเทศญี่ปุ่นเมื่อวันที่ 4 กุมภาพันธ์ พ.ศ. 2562 บันทึกชีวิตของทันจิโร่และเซ็นอิตสึก่อนที่จะเริ่มซีรีส์หลัก เช่นเดียวกับการมองเข้าไปในชีวิตของอะโอะอิและคะนะโอะ[8] นอกจากนี้ยังมีบทเดียวของจักรวาลสำรองที่ตัวละครในซีรีส์กำลังเข้าร่วมโรงเรียนมัธยม

นวนิยายไลต์โนเวลที่ 2 ได้มีการสิทธิคือ ดาบพิฆาตอสูร: หนึ่งปีกแห่งผีเสื้อ (鬼滅の刃 片羽の蝶 (Kimetsu no Yaiba Katahane no Chō)) เขียนแต่งนิยายโดย โคโยฮารุ โกโตเกะ และ ยาจิมะ อายะ เมื่อวันที่ 4 ตุลาคม พ.ศ. 2562 รายละเอียดชีวิตของโคโจ ชิโนะบุ และคะนะเอะ ก่อนและไม่นานหลังจากนั้นพวกเธอเข้าร่วมเหล่านักล่าอสูร หลังจากฮิเมะจิมะ เกียวเม ช่วยชีวิตพวกเขา[9][10]

อนิเมะ
โทรทัศน์ซีรีส์อนิเมะ ถูกดัดแปลงโดยสตูดีโอยูโฟเทเบิล (Ufotable) ถูกประกาศในการตีพิมพ์ครั้งที่ 27 ของโชเน็งจัมป์รายสัปดาห์ ในวันที่ 4 มิถุนายน พ.ศ. 2561[11] ซีรีส์อนิเมะได้ออกอากาศเมื่อวันที่ 6 เมษายน - 28 กันยายน พ.ศ. 2559 ออกอากาศในช่อง โตเกียว เอ็มเอ็กซ์, กุนมะทีวี (GTV), โทชิกิทีวี (GYT), สถานีโทรทัศน์นิปปอนบีเอส (BS11) และช่องโทรทัศน์อื่น ๆ ของประเทศญี่ปุ่น[12][13] อนิเมะเรื่องนี้กำกับโดย โซะโตะซากิ ฮารุโอะ กับสคริปต์เรื่องราวโดยทีมงานยูโฟเทเบิล ผู้ประพันธ์เพลงประกอบเรื่องอนิเมะคือ คะจิอุระ ยูกิ และชีอีนะ โก และดีไซน์ตัวละครคือ มัตสึชิมะ อะคิระ โปรดิวเซอร์คือ คนโดะ ฮิคะรุ[14] ในเพลงเปิดประกอบเรื่องคือเพลง กุเรนเกะ (紅蓮華 (Gurenge) แปล: ดอกบัวสีแดง) ศิลปินโดย ลิซ่า (โอะริเบะ ริซะ)[15] ในขณะช่วงเพลงประกอบจบในเรื่องคือ ฟอร์มดิเอจ (อังกฤษ: Form the edge) ศิลปินโดยฟิคชั่นจังค์ชั่น (FictionJunction) ร้องคู่กับลิซ่า[16] ในเพลงจบของเรื่องสำหรับตอนที่ 19 คือ คามะโดะ ทันจิโร่ โนะ อุตะ (竈門炭治郎のうた (Kamado Tanjirō no Uta) แปล: บทเพลงของคามาโดะ ทันจิโร่) ศิลปินโดย ชีอินะ โก พร้อมเนื้อเรื่องโดย นะคะกะวะ นามิ ซีรีส์อนิเมะนี้มี 26 ตอน[17] อนิเพล็กซ์ออฟอเมริกา (Aniplex of America) ได้รับประกาศใบอนุญาตลิขสิทธิ์เพื่อซื้อลิขสิทธิ์อนิเมะเรื่องนี้[18] ได้รับการสตรีมบน ครันชี่โรล, ฮูลู และฟูนิเมชั่นนาว[19] อนิเมะแล็บได้แคสท์อนิเมะเรื่องนี้ในประเทศออสเตรเลียและนิวซิแลนด์[20] ในประเทศไทย มีมิวส์ คอมมิวนิเคชันเป็นผู้ถือลิขสิทธิ์หลัก ออกอากาศฉบับตอนซีรีส์ในหลายช่องทางหลัก อาทิ ทรูไอดี เอไอเอส เพลย์ เน็ตฟลิกซ์ ดิสนีย์+ ฮอตสตาร์ แอมะซอน ไพร์ม วิดีโอ และทางช่องการ์ตูนคลับ ทั้งนี้การ์ตูนคลับยังเป็นผู้ถือลิขสิทธิ์ซีรีส์สำหรับการออกอากาศผ่านช่องทางฟรีทีวีในประเทศไทยอีกด้วย

ในส่วนของฤดูกาลที่ 2 (ภาคศึกรถไฟสู่นิรันดร์ และภาคย่านเริงรมย์) ฤดูกาลที่ 3 (ภาคหมู่บ้านช่างตีดาบ) และฤดูกาลที่ 4 (ภาคการสั่งสอนของเสาหลัก) มิวส์ คอมมิวนิเคชัน ยังคงเป็นผู้ถือลิขสิทธิ์หลักสำหรับการออกอากาศทางช่องทางออนไลน์หลากหลายช่องทาง อาทิ เน็ตฟลิกซ์ ทรูไอดี วิว อ้ายฉีอี้ วีทีวี ปิลิปิลิ ป๊อปส์ และแอมะซอน ไพร์ม วิดีโอ โดยการ์ตูนคลับเป็นผู้จัดทำเสียงพากย์ภาษาไทยให้กับทางมิวส์

ภาพยนตร์อนิเมะ
ในวันที่ 28 กันยายน พ.ศ. 2562 ตามออกอากาศตอนที่ 26 ทันที ต่อมาได้ประกาศภาพยนตร์อนิเมะชื่อว่า ดาบพิฆาตอสูร เดอะมูฟวี่: ศึกรถไฟสู่นิรันดร์ (鬼滅の刃 無限列車編 (Kimetsu no Yaiba: Mugen Ressha-hen)) พร้อมกับทีมงานและใช้บทบาทของตน[21] ภาพยนตร์นี้จะเป็นภาคต่อโดยตรงของซีรีส์อนิเมะซึ่งอิงกับบท "ศึกรถไฟสู่นิรันดร์" จากหนังสือซีรีส์มังงะ[22][23] ในวันที่ 10 เมษายน พ.ศ. 2563 ได้ประกาศภาพยนตร์อนิเมะนี้จะออกเปิดตัวทั้งในระบบปกติและระบบไอแมกซ์ในประเทศญี่ปุ่นเมื่อ 16 ตุลาคม พ.ศ. 2563[24] โดยอนิเพล็กซ์และโตโฮ[25] ในประเทศไทย เอ็ม พิคเจอร์ เป็นผู้ถือลิขสิทธ์การแพร่ภาพในโรงภาพยนตร์ โดยเปิดตัวรอบพิเศษในโรงภาพยนตร์กรุงเทพไอแมกซ์ 6 สาขา และโรงภาพยนตร์เอสเอฟ ซีเนม่าสาขาที่ร่วมรายการในวันที่ 3 ธันวาคม พ.ศ. 2563 ก่อนเข้าฉายในโรงภาพยนตร์ระบบปกติทั่วประเทศในวันที่ 9 ธันวาคม พ.ศ. 2563 โดยทำรายได้ในวันเปิดตัว 7.68 ล้านบาท ทำลายสถิติของภาพยนตร์ สแตนด์บายมี โดราเอมอน เพื่อนกันตลอดไป (5.4 ล้านบาท), วันพีซ สแตมปีด (5.37 ล้านบาท), รวมถึง หลับตาฝัน ถึงชื่อเธอ (3.41 ล้านบาท) ขึ้นเป็นภาพยนตร์แอนิเมชันจากประเทศญี่ปุ่นที่ทำรายได้สูงสุดในวันเปิดตัวในไทย และยังทำลายสถิติของภาพยนตร์ เทเน็ท ขึ้นเป็นภาพยนตร์ระบบไอแมกซ์ 2 มิติที่ทำรายได้เปิดตัวสูงสุดใน พ.ศ. 2563 และ เป็นภาพยนตร์ระบบไอแมกซ์ที่ทำรายได้เปิดตัวเป็นอันดับสองใน พ.ศ. 2563 รองจาก มู่หลาน

ต่อมาในเดือนธันวาคม พ.ศ. 2565 ได้มีการประกาศเวิลด์ทัวร์ครั้งแรกของดาบพิฆาตอสูร สู่หมู่บ้านช่างตีดาบ เพื่อสอดรับกับการฉายซีรีส์ฤดูกาลที่ 3 ในเดือนเมษายน พ.ศ. 2566 ภาพยนตร์ดังกล่าวไม่เหมือนกับภาพยนตร์ ศึกรถไฟสู่นิรันดร์ ที่เป็นการนำเนื้อเรื่องจากต้นฉบับมาทำเป็นภาพยนตร์ก่อนดัดแปลงเป็นทีวีซีรีส์ในองค์แรกของฤดูกาลที่ 2 แต่เป็นการนำทีวีซีรีส์มารวบเป็นภาพยนตร์ความยาว 110 นาที ประกอบด้วย 2 ตอนสุดท้ายของภาคย่านเริงรมย์ รวมกับตอนที่ 1 ของภาคหมู่บ้านช่างตีดาบ ภาพยนตร์ดังกล่าวเข้าฉายในประเทศญี่ปุ่นวันที่ 3 กุมภาพันธ์ พ.ศ. 2566 โดยในประเทศไทย มิวส์ คอมมิวนิเคชัน และ เอ็ม พิคเจอร์ เป็นผู้ถือลิขสิทธ์การแพร่ภาพในโรงภาพยนตร์ โดยออกฉายในประเทศไทยวันที่ 23 กุมภาพันธ์ พ.ศ. 2566

ในเดือนธันวาคม พ.ศ. 2566 ได้มีการประกาศเวิลด์ทัวร์ครั้งที่สองในชื่อ ปาฏิหารย์แห่งสายสัมพันธ์ สู่การสั่งสอนของเสาหลัก เพื่อสอดรับกับการฉายซีรีส์ฤดูกาลที่ 4 ในเดือนเมษายน พ.ศ. 2567 ภาพยนตร์ดังกล่าวยังคงเป็นการนำทีวีซีรีส์มารวบเป็นภาพยนตร์ ประกอบด้วยตอนสุดท้ายของภาคหมู่บ้านช่างตีดาบ รวมกับตอนที่ 1 ของภาคการสั่งสอนของเสาหลัก ภาพยนตร์ดังกล่าวเข้าฉายในประเทศญี่ปุ่นวันที่ 2 กุมภาพันธ์ พ.ศ. 2567 ในประเทศไทย มิวส์ คอมมิวนิเคชัน เป็นผู้ถือลิขสิทธ์การแพร่ภาพในโรงภาพยนตร์ และให้ไฟว์สตาร์โปรดักชั่นเป็นผู้จัดจำหน่ายภาพยนตร์ โดยออกฉายในประเทศไทยวันที่ 29 กุมภาพันธ์ พ.ศ. 2567

และในเดือนมิถุนายน พ.ศ. 2567 หลังจากการออกอากาศในตอนที่ 7 ของภาคการสั่งสอนของเสาหลักจบลงแบบทันที อะนิเพล็กซ์ได้มีการประกาศภาคสุดท้ายของซีรีส์ ปราสาทไร้ขอบเขต จะถูกนำไปทำเป็นภาพยนตร์ไตรภาค ภาคแรกจากไตรภาคมีกำหนดฉายพร้อมกันทั่วโลกในปี พ.ศ. 2568 โดยเริ่มจากประเทศญี่ปุ่นในวันที่ 18 กรกฎาคม พ.ศ. 2568 ทั้งนี้ครันซ์ชีโรลจะถือลิขสิทธิ์ภาพยนตร์นี้แต่เพียงผู้เดียวทั่วโลก และให้โซนี่พิคเจอร์รีลีดซิงเป็นผู้จัดจำหน่าย ซึ่งในประเทศไทย โคลอมเบีย พิคเจอร์ ประเทศไทย (โซนี่ พิคเจอร์ ประเทศไทย) เป็นผู้ถือลิขสิทธิ์ภาพยนตร์ โดยมีกำหนดเข้าฉายในประเทศไทยวันที่ 12 สิงหาคม พ.ศ. 2568 โดยหลังเข้าฉายภาพยนตร์ทำลายทุกสถิติของวงการภาพยนตร์ไทยในรอบ 6 ปีหลังการระบาดทั่วของโควิด-19 ทั้งทำสถิติรายได้วันเปิดตัวสูงเป็นประวัติการณ์ถึง 33.35 ล้านบาท ทำลายสถิติเดิมของ กัปตัน อเมริกา: ศึกฮีโร่จักรวาลใหม่ ขึ้นเป็นภาพยนตร์เปิดตัวสูงที่สุดในปี 2568 ทำลายสถิติเดิมของ อวตาร: วิถีแห่งสายน้ำ เป็นภาพยนตร์ที่มียอดจองบัตรชมภาพยนตร์ล่วงหน้าสูงที่สุดในประเทศไทย และเป็นภาพยนตร์ในระบบไอแมกซ์ที่มีทั้งยอดจองและยอดผู้ชมวันแรกสูงที่สุดเป็นประวัติการณ์นับตั้งแต่มีไอแมกซ์ในประเทศไทย และเป็นภาพยนตร์ที่มีผู้ชมในระบบไอแมกซ์ตลอดโปรแกรมฉาย (12 สิงหาคม - 3 กันยายน) สูงที่สุดเป็นลำดับที่ 3 รองจาก ธี่หยด 2 และ อวตาร: วิถีแห่งสายน้ำ ซึ่งปรากฎการณ์ทั้งหมดทำให้ภาพยนตร์ได้ทำลายสถิติเดิมของ ผจญภัยปริศนาราชินีหิมะ ขึ้นเป็นภาพยนตร์แอนิเมชันทำเงินสูงสุดในประเทศไทยด้วยรายได้ปัจจุบันเฉพาะกรุงเทพและปริมณฑล และเชียงใหม่ ณ 12 กันยายน พ.ศ. 2568 ที่ 167.57 ล้านบาท เป็นลำดับที่ 48 ของภาพยนตร์ที่ทำเงินสูงสุดในประเทศไทย

วิดีโอเกม
เกมมือถือชื่อว่า ดาบพิฆาตอสูร: ใบมีดดาบแห่งกลิ่นเลือด (鬼滅の刃 血風剣戟ロワイアル (Kimetsu no Yaiba: Keppū Kengeki Royale)) ได้ประกาศและปล่อยตัวเกมเมื่อปี พ.ศ. 2563 โดยสำนักพิมพ์อนิเพล็กซ์ พร้อมกับผู้พัฒนาโดยบริษัทอนิเพล็กซ์ สาขาควาโทรเอ (Quatro A)[26] วิดีโอเกมนี้เผยแพร่โดยอนิเพล็กซ์และพัฒนาโดยคิวเบอร์คอนเน็คต์ทู (Cuberconnect2) ชื่อวิดีโอเกมว่า ดาบพิฆาตอสูร: สายลมเลือดแห่งระบำเทพอัคคี (鬼滅の刃 ヒノカミ血風譚 (Kimetsu no Yaiba: Hinokami Chifūtan)) สำหรับเพลย์สเตชัน 4 ได้มีการประกาศว่าจะปล่อยวิดีโอเกมนี้เมื่อปี พ.ศ. 2564[27][28][29]",
        "watch_url": "https://www.bilibili.tv/th/search-result?q=%E0%B8%94%E0%B8%B2%E0%B8%9A%E0%B8%9E%E0%B8%B4%E0%B8%86%E0%B8%B2%E0%B8%95%E0%B8%AD%E0%B8%AA%E0%B8%B9%E0%B8%A3",
        "read_more_url": "https://th.wikipedia.org/wiki/%E0%B8%94%E0%B8%B2%E0%B8%9A%E0%B8%9E%E0%B8%B4%E0%B8%86%E0%B8%B2%E0%B8%95%E0%B8%AD%E0%B8%AA%E0%B8%B9%E0%B8%A3",
        "image_src": "https://lh3.googleusercontent.com/d/1MqLDcJb0FeEj9W5DrWY83abMEVI9ZepW"
    },
    {
        "id": 2,
        "title": "อาเนีย ฟอร์เจอร์ (SPY×FAMILY)",
        "post_date": "4 มิถุนายน 2026",
        "category": "anime",
        "category_color": "#2ecc71",
        "detail": "ตัวละครเอกสุดน่ารักจากมังงะและอนิเมะเรื่อง SPY×FAMILY เธอเป็นเด็กหญิงวัยอนุบาลผู้มีพลังจิตอ่านใจคนได้ โดยเธอเป็นลูกบุญธรรมของ ลอยด์ ฟอร์เจอร์ และ ยอร์ ฟอร์เจอร์...",
        "read_more_url": "https://th.wikipedia.org/wiki/%E0%B8%AD%E0%B8%B2%E0%B9%80%E0%B8%99%E0%B8%B5%E0%B8%A2_%E0%B8%9F%E0%B8%AD%E0%B8%A3%E0%B|%E0%B9%80%E0%B8%88%E0%B8%AD%E0%B8%A3%E0%B9%8C",
        "image_src": "https://lh3.googleusercontent.com/d/151TYWInHApCUrM0CCoLGihMkZXY62KDn"
    },
    {
        "id": 3,
        "title": "เด้งโดด เปลี่ยนโหมดเป็นบีเวอร์ (Hoppers)",
        "post_date": "5 มิถุนายน 2026",
        "category": "local",
        "category_color": "#e67e22",
        "detail": "เป็นภาพยนตร์แอนิเมชันอเมริกัน แนววิทยาศาสตร์และตลก ผลิตโดยพิกซาร์แอนิเมชันสตูดิโอส์ สำหรับวอลต์ดิสนีย์พิกเชอส์ ออกฉายใน ค.ศ. 2026 กำกับโดยแดเนียล ชอง และเขียนบทโดยชองร่วมกับเจสซี แอนดรูส...",
        "read_more_url": "https://th.wikipedia.org/wiki/%E0%B%9e%E0%B9%88%E0%B8%87%E0%B9%82%E0%B8%94%E0%B8%94_%E0%B%9e%E0%B9%85%E0%B8%A5%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%99%E0%B9%82%E0%B8%AB%E0%B8%A1%E0%B8%94%E0%B%9e%E0%B9%85%E0%B8%A5%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%99%E0%B9%82%E0%B8%AB%E0%B8%A1%E0%B8%94%E0%B9%80%E0%B%9e%E0%B9%85%E0%B8%99%E0%B8%9A%E0%B8%B5%E0%B9%80%E0%B8%A7%E0%B8%AD%E0%B8%A3%E0%B9%8C",
        "image_src": "https://lh3.googleusercontent.com/d/1-aB4D7ibjtKmHCdMMUi45r2BjKlB37A1"
    },
    {
        "id": 4,
        "title": "ทอมแอนด์เจอร์รี่ (Tom & Jerry)",
        "post_date": "18 มิถุนายน 2026",
        "category": "local",
        "category_color": "#e67e22",
        "detail": "เป็นการ์ตูนชุดอเมริกันแนวตลกเจ็บตัว และเป็นสื่อแฟรนไชส์ของเมโทร-โกลด์วิน-เมเยอร์ ปัจจุบันย้ายมาสังกัด บริษัท เทอร์เนอร์เอ็นเตอร์เทนเมนต์...",
        "read_more_url": "https://th.wikipedia.org/wiki/%E0%B8%B7%E0%B8%AD%E0%B9%81%E0%B8%AD%E0%B8%99%E0%B8%94%E0%B9%8C%E0%B9%80%E0%B8%A5%E0%B8%A3%E0%B8%B5%E0%B9%88",
        "image_src": "https://lh3.googleusercontent.com/d/1Vp9tgyvoLOoINGfvyR9UfPbeeZCPdYpx"
    }
]

SUPPORT_INFO = {
    "discord_link": "https://discord.gg/9PAfy4T7",
    "promptpay": "063-116-2889",
    "qr_link": "https://drive.google.com/thumbnail?id=1_Cs8SfqmciI5SUZVT-j2NFU4LG20cwZn&sz=w600"
}

@app.route('/')
def home():
    return render_template('index.html', articles=ALL_NEWS, current_tab='all')

@app.route('/category/<cat_name>')
def category(cat_name):
    filtered_news = [article for article in ALL_NEWS if article['category'] == cat_name]
    return render_template('index.html', articles=filtered_news, current_tab=cat_name)

@app.route('/support')
def support():
    return render_template('index.html', articles=[], current_tab='support', support=SUPPORT_INFO)


# ===== เพิ่ม Route สำหรับหน้าอ่านเนื้อหาแยกตรงนี้ครับ =====
@app.route('/article/<int:article_id>')
def article_detail(article_id):
    # วนลูปค้นหาบทความใน ALL_NEWS ที่มี id ตรงกับตัวเลขบน URL
    article = next((item for item in ALL_NEWS if item["id"] == article_id), None)
    
    # ถ้าไม่พบบทความ (เช่นใส่ id มั่วมา) ให้ส่งหน้า Error 404 ไป
    if article is None:
        abort(404)
        
    # ส่งข้อมูลตัวแปรชื่อ article ไปที่หน้า detail.html
    return render_template('detail.html', article=article)


if __name__ == '__main__':
    app.run(debug=True)
